{
    "INTRO": {
        "GREETING": "Hey,ich bin",
        "NAME": "Mahmoud Gharib Said Gharib",
        "DESCRIPTION": "Ich bin derzeit Softwareentwickler mit zwei Jahren Erfahrung. In meiner Rolle habe ich ein ERP-System für Mitarbeiter mit Tausenden von Nutzern entwickelt und aufgebaut und eng mit funktionsübergreifenden Teams zusammengearbeitet, um eine nahtlose Leistung und Benutzererfahrung sicherzustellen. Ich habe starke Fähigkeiten in Backend- und Frontend-Technologien, einschließlich Nest.js, Symfony und Angular. Meine Programmierkenntnisse umfassen TypeScript, PHP, Zig und Python, mit Erfahrung in der Arbeit mit SQL- und NoSQL-Datenbanken. Darüber hinaus bin ich erfahren im Einsatz von Docker für Containerisierung und Umgebungsmanagement. Ich habe ein Berufsschulprogramm in Informatik in Polen abgeschlossen und freue mich darauf, meine Fähigkeiten und Erfahrungen in neue Möglichkeiten einzubringen.",
        "EXPERIENCE": "Erfahrung",
        "CONTACT": "Kontakt",
        "COMPANY": "Firmen name",
        "PHONE": "Telefonnummer",
        "MESSAGE": "Nachricht",
        "SEND": "Senden",
        "PROJECTS": "Projekte",
        "COMPANY_NAME": {
            "REQUIRED": "Firmenname ist erforderlich."
        },
        "PHONE_VALIDATION": {
            "REQUIRED": "Die Telefonnummer ist erforderlich.",
            "INVALID": "Die Telefonnummer ist ungültig, bitte überprüfen Sie sie.."
        },
        "MESSAGE_VALIDATION": {
            "REQUIRED": "Nachricht ist erforderlich."
        },
        "WORK": {
            "EKO_OKNA": {
                "TASKS": [
                    "Zusammenarbeit mit funktionsübergreifenden Teams zur Gestaltung, Entwicklung und Wartung des ERP-Systems, um benutzerfreundliche, reaktionsschnelle Schnittstellen und effiziente Backend-Systeme sicherzustellen.",
                    "Arbeit mit Technologien wie HTML, CSS, JavaScript, um dynamische, responsive Benutzeroberflächen zu erstellen.",
                    "Entwicklung und Optimierung der serverseitigen Logik mit Symfony, PHP zur Verbesserung der Leistung und Skalierbarkeit.",
                    "Integration von Datenbanken wie MySQL, PostgreSQL, MongoDB und Sicherstellung einer nahtlosen Kommunikation zwischen Frontend und Backend.",
                    "Nutzung von RESTful APIs und Drittanbieterbibliotheken zur Erweiterung der Funktionalität und Integration externer Dienste.",
                    "Teilnahme an Code-Reviews und Zusammenarbeit mit Senior-Entwicklern, um Best Practices in der Softwareentwicklung zu befolgen.",
                    "Verwendung von Versionskontrollsystemen (z. B. Git), um Entwicklungsabläufe zu verwalten und zu dokumentieren.",
                    "Unterstützung beim Debuggen und Beheben von Problemen auf beiden Seiten des Stacks, sowohl auf der Client- als auch auf der Serverseite.",
                    "Arbeit in einem agilen Umfeld, Beitrag zu Sprints und aktive Teilnahme an täglichen Stand-ups, Retrospektiven und Sprint-Planung."
                ],
                "DATES": {
                    "START": "März 2023",
                    "END": "Nov 2024"
                },
                "COMPANY": "Eko Okna S.A.",
                "TITLE": {
                    "JOB": "Full-Stack-Entwickler"
                },
                "PERIOD": {
                    "START": "März 2023",
                    "END": "Nov 2024"
                }
            },
            "FREELANCER": {
                "TASKS":[
                    "Eine Full-Stack-Progressive-Webanwendung für die Online-Buchung von Reisen, von Grund auf entworfen und mit modernen Technologien entwickelt.",
                    "Diese App ermöglicht es Benutzern, Reisen mühelos zu durchsuchen, zu buchen und zu verwalten.",
                    "Entwickelt mit: Angular (18+), NestJS, TypeORM, MySQL, Swagger, Material Design, Spartan UI.",
                    "Frontend: Eine responsive und intuitive Benutzeroberfläche mit Angular, Material Design und Spartan UI implementiert, um eine reibungslose und konsistente Benutzererfahrung auf verschiedenen Geräten sicherzustellen.",
                    "Backend: Eine RESTful API mit NestJS und TypeORM unter Verwendung von MySQL für die Datenpersistenz entwickelt. Skalierbarkeit und Wartbarkeit der Backend-Architektur sichergestellt.",
                    "RESTful APIs und Drittanbieterbibliotheken genutzt, um die Funktionalität zu erweitern und externe Dienste zu integrieren.",
                    "API-Dokumentation: Die gesamte API von Grund auf mit Swagger entworfen und dokumentiert, um die Zusammenarbeit zwischen Entwicklern zu verbessern und die Integration zu erleichtern.",
                    "Progressive Web App (PWA): Offline-Funktionen und Push-Benachrichtigungen ermöglicht, um den Benutzern eine native App-ähnliche Erfahrung zu bieten.",
                    "Herausforderungen gemeistert: Die Leistung für große Datensätze optimiert und komplexe Buchungsworkflows verwaltet."
                ],                
                "DATES": {
                    "START": "Nov 2024",
                    "END": ""
                },
                "platform": "Freelancer",
                "TITLE": {
                    "JOB": "Full-Stack-Entwickler"
                },
                "PERIOD": {
                    "START": "Nov 2024",
                    "END": null
                }
            }
        }
    }
}