{
    "INTRO": {
        "GREETING": "Hey I'm",
        "NAME": "Mahmoud Gharib Said Gharib",
        "DESCRIPTION": "I’m currently a software engineer with two years of experience. In my role, I have developed and built an ERP system for employees with thousands of users, collaborating closely with cross-functional teams to ensure seamless performance and user experience. I have strong skills in both backend and frontend technologies, including Nest.js, Symfony, and Angular. My programming expertise spans TypeScript, PHP, Zig, and Python, with proficiency in working with both SQL and NoSQL databases. Additionally, I’m skilled in using Docker for containerization and environment management. I completed a vocational school program in Computer Science in Poland and am excited to bring my skills and experience to new opportunities.",
        "EXPERIENCE": "Experience",
        "CONTACT": "Contact",
        "COMPANY": "Company Name",
        "PHONE": "Phone Number",
        "MESSAGE": "Message",
        "SEND": "Send",
        "PROJECTS": "Projects",
        "COMPANY_NAME": {
            "REQUIRED": " Company name is required."
        },
        "PHONE_VALIDATION":{
          "REQUIRED": "Phone number is required.",
          "INVALID": "Phone number is not valid please check."
        },
        "MESSAGE_VALIDATION":{
          "REQUIRED": "Message is required."
        },
        "WORK": {
            "EKO_OKNA": {
                "TASKS": [
                    "Collaborated with cross-functional teams to design, develop and maintain System ERP, ensuring responsive user-friendly interfaces and efficient backend systems.",
                    "Worked with technologies such as HTML, CSS, JavaScript to create dynamic, responsive user interfaces.",
                    "Developed and optimized server-side logic using Symfony, PHP to enhance performance and scalability.",
                    "Integrated databases like MySQL, PostgreSQL, MongoDB and ensured seamless communication between the front end and back end.",
                    "Utilized RESTful APIs and third-party libraries for enhanced functionality and to integrate external services.",
                    "Participated in code reviews and collaborated with senior developers to follow best practices in software development.",
                    "Used version control systems (e.g., Git) to manage and document development workflows.",
                    "Assisted in debugging and resolving issues across the stack, both on the client and server sides",
                    "Worked in an Agile environment, contributing to sprints and actively participating in daily stand-ups,retrospectives, and sprint planning."
                ],
                "DATES": {
                    "START": "Mar 2023",
                    "END": "Nov 2024"
                },
                "COMPANY": "Eko Okna S.A.",
                "TITLE": {
                    "JOB": "FullStack Engineer"
                },
                "PERIOD": {
                    "START": "Mar 2023",
                    "END": "Nov 2024"
                }
            },
            "FREELANCER": {
                "TASKS": [
                    "A full-stack progressive web application for booking travel trips online",
                    "designed and developed from scratch using modern technologies.",
                    " This app allows users to browse book and manage travel trips effortlessly.",
                    "Built with: Angular (18+), NestJS, TypeORM, MySQL, Swagger, Material Design, Spartan UI.",
                    "Front-End: Implemented a responsive and intuitive user interface using Angular, Material Design, and Spartan UI, ensuring a smooth and consistent UX across devices.",
                    "Back-End: Developed a RESTful API using NestJS and TypeORM with MySQL for data persistence. Ensured scalability and maintainability of the backend architecture.",
                    "Utilized RESTful APIs and third-party libraries for enhanced functionality and to integrate external services.",
                    "Back-End: Developed a RESTful API using NestJS and TypeORM with MySQL for data persistence. Ensured scalability and maintainability of the backend architecture.",
                    "API Documentation: Designed and documented the entire API from scratch using Swagger for better developer collaboration and ease of integration.",
                    "Progressive Web App (PWA): Enabled offline capabilities and push notifications, providing a native-like experience for users.",
                    "Challenges Overcome: Optimized performance for large data sets and managed complex booking workflows."
                ],
                "DATES": {
                    "START": "Nov 2024",
                    "END": ""
                },
                "platform": "Freelancer",
                "TITLE": {
                    "JOB": "FullStack Engineer"
                },
                "PERIOD": {
                    "START": "Nov 2024",
                    "END": null
                }
            }
        }
    }
}